---
type: FluidTemperatureSetIterator
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 8
tags: [revit-api, class]
---

# FluidTemperatureSetIterator

`Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrent | 2013 | `public FluidTemperature GetCurrent ()` |
| Method | IsDone | 2013 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2013 | `public virtual bool MoveNext ()` |
| Method | Reset | 2013 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual FluidTemperature Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |